Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes Methods
The ModelObjectHatchAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
ModelObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace